cfd/channelCase/system/blockMeshDict
FoamFile
{
    version 2.0;
    format ascii;
    class dictionary;
    object blockMeshDict;
}

// Modern keyword for OpenFOAM v1912+
scale 0.001;

vertices
(
    (-5 -2 -1) // 0
    ( 60 -2 -1) // 1
    ( 60  2 -1) // 2
    (-5  2 -1) // 3
    (-5 -2  2) // 4
    ( 60 -2  2) // 5
    ( 60  2  2) // 6
    (-5  2  2) // 7
);

blocks
(
    // 260x16x12 results in ~0.25mm cubic cells
    hex (0 1 2 3 4 5 6 7) (260 16 12) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
  box
  {
    type patch;
    faces
    (
      (0 4 7 3)
      (1 2 6 5)
      (0 1 5 4)
      (3 7 6 2)
      (0 3 2 1)
      (4 5 6 7)
    );
  }
);

mergePatchPairs
(
);
