cfd/channelCase/system/snappyHexMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      snappyHexMeshDict;
}

castellatedMesh true;
snap            true;
addLayers       false;

geometry
{
    channel_walls.stl
    {
        type triSurfaceMesh;
        file "channel_walls.stl";
        name walls;
        scale 0.001;
    }

    channel_inlet.stl
    {
        type triSurfaceMesh;
        file "channel_inlet.stl";
        name inlet;
        scale 0.001;
    }

    channel_outlet.stl
    {
        type triSurfaceMesh;
        file "channel_outlet.stl";
        name outlet;
        scale 0.001;
    }

    channel_fluid.stl
    {
      type triSurfaceMesh;
      file "channels_fluid.stl";
      name fluid_core;
      scale 0.001;
    }
}

castellatedMeshControls
{
    maxLocalCells 1500000;
    maxGlobalCells 3000000;
    minRefinementCells 50;
    nCellsBetweenLevels 2;

    features
    (
        {
            file "channel_walls.eMesh";
            level 2;
        }
        {
            file "channel_inlet.eMesh";
            level 2;
        }
        {
            file "channel_outlet.eMesh";
            level 2;
        }
    );

    refinementSurfaces
    {
        walls
        {
            level (2 3);
            patchInfo
            {
                type wall;
            }
        }

        inlet
        {
            level (2 3);
            patchInfo
            {
                type patch;
            }
        }

        outlet
        {
            level (2 3);
            patchInfo
            {
                type patch;
            }
        }
    }

    resolveFeatureAngle 30;

    refinementRegions
    {
      fluid_core
      {
          mode inside;
          levels ((1e15 2)); // Applies level 2 refinement to all cells inside
      }
    }


    // Moving location in mesh, deep into absolute center of fluid volume
    locationInMesh (0.025 0 0.00025);

    allowFreeStandingZoneFaces true;
}

snapControls
{
    nSmoothPatch 8;
    tolerance 0.8;
    nSolveIter 75;
    nRelaxIter 8;

    nFeatureSnapIter 30;
    implicitFeatureSnap true;
    explicitFeatureSnap true;
}

addLayersControls
{
}

meshQualityControls
{
    maxNonOrtho 40;
    maxBoundarySkewness 15;
    maxInternalSkewness 3;
    maxConcave 60;
    minVol 1e-12;
    minTetQuality 1e-08;
    minArea -1;
    minTwist 0.02;
    minDeterminant 0.005;
    minFaceWeight 0.02;
    minVolRatio 0.01;
    minTriangleTwist -1;
    nSmoothScale 4;
    errorReduction 0.6;
}

mergeTolerance 1e-6;
