cfd/channelCase/system/surfaceFeaturesDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      surfaceFeaturesDict;
}

surfaces
(
    "channel_walls.stl"
    "channel_inlet.stl"
    "channel_outlet.stl"
    "channels_fluid.stl"
);

includedAngle 150;
